# 6.1 Lendo e Escrevendo dados em formato-texto

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d','message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
parsed = pd.read_csv('examples/csv_mindex.csv')
parsed.index.name='Linhas'
parsed

       key1 key2  value1  value2
Linhas
0       one    a       1       2
1       one    b       3       4
2       one    c       5       6
3       one    d       7       8
4       two    a       9      10
5       two    b      11      12
6       two    c      13      14
7       two    d      15      16

In [8]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [9]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [10]:
result = pd.read_table('examples/ex3.txt', sep='\s+') #sep é uma expressão regular usado como delimitador
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
f = open("examples/ex4.csv", "r")
print(f.read())

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3]) #Ele não lê as linhas 0, 2 e 3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
f = open("examples/ex5.csv", "r")
print(f.read())

something,a,b,c,d,message
one,ausente,2,3,4,NA
two,5,6,,8,world
three,NULL,10,11,12,foo

In [14]:
result = pd.read_csv('examples/ex5.csv')
result

  something        a   b     c   d message
0       one  ausente   2   3.0   4     NaN
1       two        5   6   NaN   8   world
2     three      NaN  10  11.0  12     foo

In [15]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False   True  False  False  False    False

In [16]:
result =  pd.read_csv('examples/ex5.csv', na_values=['ausente']) #na_values pode passar uma lista de valores a serem consideradsos ausentes
result

  something    a   b     c   d message
0       one  NaN   2   3.0   4     NaN
1       two  5.0   6   NaN   8   world
2     three  NaN  10  11.0  12     foo

In [17]:
result =  pd.read_csv('examples/ex5.csv', na_values={'d': [4, 12], 'b': [6]})
result

  something        a     b     c    d message
0       one  ausente   2.0   3.0  NaN     NaN
1       two        5   NaN   NaN  8.0   world
2     three      NaN  10.0  11.0  NaN     foo

Lendo Arquivos-texto em partes

In [18]:
pd.options.display.max_rows = 10
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [19]:
pd.read_csv('examples/ex6.csv', nrows=7)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U

In [20]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

Escrevendo dados em formato-texto

In [21]:
data = pd.read_csv('examples/ex5.csv')
data

  something        a   b     c   d message
0       one  ausente   2   3.0   4     NaN
1       two        5   6   NaN   8   world
2     three      NaN  10  11.0  12     foo

In [22]:
data.to_csv('examples/out.csv') #escreve os dados no out.csv separados por vírgula

In [23]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|ausente|2|3.0|4|
1|two|5|6||8|world
2|three||10|11.0|12|foo

In [24]:
data.to_csv(sys.stdout, na_rep='NULL') #Mostra os valores vazios como NULL

,something,a,b,c,d,message
0,one,ausente,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,NULL,10,11.0,12,foo

In [25]:
data.to_csv(sys.stdout, na_rep='NULL', index=False, header=False)

one,ausente,2,3.0,4,NULL
two,5,6,NULL,8,world
three,NULL,10,11.0,12,foo

In [26]:
data.to_csv(sys.stdout, na_rep='NULL', index=False, columns=['a', 'b', 'c'])

a,b,c
ausente,2,3.0
5,6,NULL
NULL,10,11.0

In [27]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv(sys.stdout)

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

Trabalhando com formatos delimitados

In [28]:
import csv
f = open("examples/ex7.csv", "r")
print(f.read())
reader = csv.reader(f)
reader

"a","b","c"
"1","2","3"
"1","2","3"

In [29]:
for line in reader:
    print(line)

In [30]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [31]:
header, values = lines[0], lines[1:]

In [32]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [33]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

f = open("examples/ex7.csv")
reader = csv.reader(f, dialect=my_dialect)
for linhas in reader:
    print(linhas)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [34]:
reader = csv.reader(f, dialect=my_dialect)
for linhas in reader:
    print(linhas)

In [35]:
with open('mydata.csv', 'w') as f:
    write = csv.writer(f, dialect=my_dialect)
    write.writerow(('one', 'two', 'three'))
    write.writerow(('1', '2', '3'))
    write.writerow(('4', '5', '6'))
    write.writerow(('7', '8', '9'))

In [36]:
f = open("mydata.csv", "r")
print(f.read())

one;two;three
1;2;3
4;5;6
7;8;9

In [37]:
obj = """
{"name" : "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null
}
"""
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None}

In [38]:
asjson = json.dumps(result) #Converte de Volta para json
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null}'

In [39]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [40]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [41]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

Fazendo parse de XML com lxml.objectify

In [42]:
from lxml import objectify
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [43]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [44]:
perf = pd.DataFrame(data)
perf

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8
...,...,...,...,...,...,...,...,...,...,...,...,...
643,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,8,Service Indicators,M,%,97.0,,97.0,
644,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,9,Service Indicators,M,%,97.0,,97.0,
645,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,10,Service Indicators,M,%,97.0,,97.0,
646,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,11,Service Indicators,M,%,97.0,,97.0,
647,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,%,97.0,,97.0,

In [45]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [46]:
root
root.get('href')
root.text

'Google'